<div class="row">
        <div class="col-lg-9">
            <h1>618.Students Report By Geography</h1>
            <div class="markdown-body" style="margin-top: 20px">
                A U.S graduate school has students from Asia, Europe and America. The students&#39; location information are stored in table <code>student1</code> as below.
<p>&nbsp;</p>

<pre>
| name   | continent |
|--------|-----------|
| Jack   | America   |
| Pascal | Europe    |
| Xi     | Asia      |
| Jane   | America   |
</pre>

<p>&nbsp;</p>
<a href="https://en.wikipedia.org/wiki/Pivot_table"> Pivot</a> the continent column in this table so that each name is sorted alphabetically and displayed underneath its corresponding continent. The output headers should be America, Asia and Europe respectively. It is guaranteed that the student number from America is no less than either Asia or Europe.

<p>&nbsp;</p>
For the sample input, the output is:

<p>&nbsp;</p>

<pre>
| America | Asia | Europe |
|---------|------|--------|
| Jack    | Xi   | Pascal |
| Jane    |      |        |
</pre>

<p>&nbsp;</p>
<b>Follow-up:</b> If it is unknown which continent has the most students, can you write a query to generate the student report?

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
student = pd.read_sql_table("student1", engine)
student

     name continent
0    Jack   America
1  Pascal    Europe
2      Xi      Asia
3    Jane   America

In [3]:
query = '''
SELECT *,
ROW_NUMBER()OVER(PARTITION BY continent ORDER BY name) AS continentorder
FROM student1;
'''
pd.read_sql_query(query, engine)

     name continent  continentorder
0    Jack   America               1
1    Jane   America               2
2      Xi      Asia               1
3  Pascal    Europe               1

In [4]:
query = '''
 SELECT 
    MAX(CASE WHEN continent = 'America' THEN name END )AS America,
    MAX(CASE WHEN continent = 'Asia' THEN name END )AS Asia,
    MAX(CASE WHEN continent = 'Europe' THEN name END )AS Europe
    FROM (
        SELECT *,
        ROW_NUMBER()OVER(PARTITION BY continent ORDER BY name) AS continentorder
        FROM student1
    ) AS SOURCE
    GROUP BY continentorder;
'''
pd.read_sql_query(query, engine)

  America  Asia  Europe
0    Jack    Xi  Pascal
1    Jane  None    None

Note:
ROW_NUMBER()OVER(PARTITION BY continent ORDER BY name)

report row number by partition.

1. Set up the row number by partition.
2. for each order for each partition, report the name [have to be min/max to report the single record since have 'group by']